# GetFootprintBoundary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..GetFootprintBoundary Method
StairsRun Class See Also
---
Returns the run's boundary curves which are projected on the stairs base level.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CurveLoop GetFootprintBoundary()
```

Visual Basic
---
```text
Public Function GetFootprintBoundary As CurveLoop
```

Visual C++
---
```text
public:
CurveLoop^ GetFootprintBoundary()
```

# ### Return Value
The boundary curves of the stairs run.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace